GCI/coarse/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    wallInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
480
(
0.99521732
1.042581
1.042581
0.99521732
0.99521732
1.042581
1.042581
0.99521732
...
)
;
    }
    wallCollector
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.98093959
1.0254528
1.0254528
0.98093959
0.96647443
1.0097265
1.0097265
0.96647443
...
)
;
    }
    wallThroat
    {
        type            calculated;
        value           nonuniform List<scalar> 
640
(
0.57442413
0.60184713
0.60184713
0.57442413
0.57442413
0.60184713
0.60184713
0.57442413
...
)
;
    }
    wallOutlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
960
(
1.0136611
1.0136075
1.0136075
1.0136611
1.0107189
1.0106649
1.0106649
1.0107189
...
)
;
    }
    stepExpansion
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
3.1030024
3.1030021
3.1030021
3.1030024
3.1022359
3.1022356
3.1022356
3.1022359
...
)
;
    }
}


// ************************************************************************* //
